In [1]:
import pandas as pd

In [2]:
df1 = pd.read_csv("freqs/b Feb24 300 1.csv").set_index("Unnamed: 0")
df2 = pd.read_csv("freqs/b Feb24 300 2.csv").set_index("Unnamed: 0")
df3 = pd.read_csv("freqs/b Feb24 300 3.csv").set_index("Unnamed: 0")
df4 = pd.read_csv("freqs/b Feb24 300 4.csv").set_index("Unnamed: 0")
df5 = pd.read_csv("freqs/b Feb24 300 5.csv").set_index("Unnamed: 0")
df6 = pd.read_csv("freqs/b Feb24 300 6.csv").set_index("Unnamed: 0")
df7 = pd.read_csv("freqs/b Feb24 300 7.csv").set_index("Unnamed: 0")
df8 = pd.read_csv("freqs/b Feb24 300 8.csv").set_index("Unnamed: 0")
df9 = pd.read_csv("freqs/b Feb24 300 9.csv").set_index("Unnamed: 0")
df10 = pd.read_csv("freqs/b Feb24 300 10.csv").set_index("Unnamed: 0")
df11 = pd.read_csv("freqs/b Feb24 300 11.csv").set_index("Unnamed: 0")
df12 = pd.read_csv("freqs/b Feb24 300 12.csv").set_index("Unnamed: 0")
df13 = pd.read_csv("freqs/b Feb24 300 13.csv").set_index("Unnamed: 0")
df14 = pd.read_csv("freqs/b Feb24 300 14.csv").set_index("Unnamed: 0")
df15 = pd.read_csv("freqs/b Feb24 300 15.csv").set_index("Unnamed: 0")

In [3]:
df1

            Mercedes-Benz
Unnamed: 0
Female                  1
Male                    8

In [4]:
joined = df1+df2+df3+df4+df5+df6+df7+df8+df9+df10+df11+df12+df13+df14+df15

In [5]:
joined

            Mercedes-Benz
Unnamed: 0
Female                 18
Male                  122

In [6]:
joined.to_csv("freqs/jb Feb 24 4500.csv")